implement-verify-service/test-results/java-repo/pipeline-output/java-design-patterns/test/diagrams/pattern-map.puml
@startuml
title Design Pattern Map

[factory] --> [AbstractFactoryTest]
[factory] --> [FactoryMaker]
[factory] --> [ElfKingdomFactory]
[factory] --> [OrcKingdomFactory]

@enduml
